## production: dns
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 5 to add, 0 to change, 5 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                    NAME                                     |
|--------|-----------------------------------------------------------------------------|
| add    | `aws_sesv2_email_identity.cic-trvapply-vrtdemande[0]`                       |
|        | `aws_sesv2_email_identity.custom_sending_domains[&quot;notification.gov.bc.ca&quot;]` |
|        | `aws_sesv2_email_identity.custom_sending_domains[&quot;notify.novascotia.ca&quot;]`   |
|        | `aws_sesv2_email_identity.notification-canada-ca`                           |
|        | `aws_sesv2_email_identity.notification-canada-ca-receiving`                 |
| delete | `aws_ses_domain_identity.cic-trvapply-vrtdemande[0]`                        |
|        | `aws_ses_domain_identity.custom_sending_domains[&quot;notification.gov.bc.ca&quot;]`  |
|        | `aws_ses_domain_identity.custom_sending_domains[&quot;notify.novascotia.ca&quot;]`    |
|        | `aws_ses_domain_identity.notification-canada-ca`                            |
|        | `aws_ses_domain_identity.notification-canada-ca-receiving`                  |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_ses_domain_identity.cic-trvapply-vrtdemande[0] will be destroyed
  # (because aws_ses_domain_identity.cic-trvapply-vrtdemande is not in configuration)
  - resource "aws_ses_domain_identity" "cic-trvapply-vrtdemande" {
      - arn                = "arn:aws:ses:ca-central-1:296255494825:identity/trvapply-vrtdemande.apps.cic.gc.ca" -> null
      - domain             = "trvapply-vrtdemande.apps.cic.gc.ca" -> null
      - id                 = "trvapply-vrtdemande.apps.cic.gc.ca" -> null
      - verification_token = "jeWUnOqXbe2e980D5tdY63DZB3WdsRCEDm/b6AcaM+4=" -> null
    }

  # aws_ses_domain_identity.custom_sending_domains["notification.gov.bc.ca"] will be destroyed
  # (because aws_ses_domain_identity.custom_sending_domains is not in configuration)
  - resource "aws_ses_domain_identity" "custom_sending_domains" {
      - arn                = "arn:aws:ses:ca-central-1:296255494825:identity/notification.gov.bc.ca" -> null
      - domain             = "notification.gov.bc.ca" -> null
      - id                 = "notification.gov.bc.ca" -> null
      - verification_token = "Rlp3YrQanXqXHLsfAmIxtWZP4rijD38vND3/Tc7TggU=" -> null
    }

  # aws_ses_domain_identity.custom_sending_domains["notify.novascotia.ca"] will be destroyed
  # (because aws_ses_domain_identity.custom_sending_domains is not in configuration)
  - resource "aws_ses_domain_identity" "custom_sending_domains" {
      - arn                = "arn:aws:ses:ca-central-1:296255494825:identity/notify.novascotia.ca" -> null
      - domain             = "notify.novascotia.ca" -> null
      - id                 = "notify.novascotia.ca" -> null
      - verification_token = "p+rLCIGLwxPH7ztlFjJk1LF5hy7aJxYxZgXj0e+ABkY=" -> null
    }

  # aws_ses_domain_identity.notification-canada-ca will be destroyed
  # (because aws_ses_domain_identity.notification-canada-ca is not in configuration)
  - resource "aws_ses_domain_identity" "notification-canada-ca" {
      - arn                = "arn:aws:ses:ca-central-1:296255494825:identity/notification.canada.ca" -> null
      - domain             = "notification.canada.ca" -> null
      - id                 = "notification.canada.ca" -> null
      - verification_token = "Ohfl/Syh3ZT5U/7IKELTCXIRaqI42ZJiw0HiUQoCHww=" -> null
    }

  # aws_ses_domain_identity.notification-canada-ca-receiving will be destroyed
  # (because aws_ses_domain_identity.notification-canada-ca-receiving is not in configuration)
  - resource "aws_ses_domain_identity" "notification-canada-ca-receiving" {
      - arn                = "arn:aws:ses:us-east-1:296255494825:identity/notification.canada.ca" -> null
      - domain             = "notification.canada.ca" -> null
      - id                 = "notification.canada.ca" -> null
      - verification_token = "FHX+PBM3ip2HfDeSXs3WpEuQZydluvX9VpOdBKj0dgU=" -> null
    }

  # aws_sesv2_email_identity.cic-trvapply-vrtdemande[0] will be created
  + resource "aws_sesv2_email_identity" "cic-trvapply-vrtdemande" {
      + arn                         = (known after apply)
      + email_identity              = "trvapply-vrtdemande.apps.cic.gc.ca"
      + id                          = (known after apply)
      + identity_type               = (known after apply)
      + tags_all                    = (known after apply)
      + verified_for_sending_status = (known after apply)

      + dkim_signing_attributes (known after apply)
    }

  # aws_sesv2_email_identity.custom_sending_domains["notification.gov.bc.ca"] will be created
  + resource "aws_sesv2_email_identity" "custom_sending_domains" {
      + arn                         = (known after apply)
      + email_identity              = "notification.gov.bc.ca"
      + id                          = (known after apply)
      + identity_type               = (known after apply)
      + tags_all                    = (known after apply)
      + verified_for_sending_status = (known after apply)

      + dkim_signing_attributes (known after apply)
    }

  # aws_sesv2_email_identity.custom_sending_domains["notify.novascotia.ca"] will be created
  + resource "aws_sesv2_email_identity" "custom_sending_domains" {
      + arn                         = (known after apply)
      + email_identity              = "notify.novascotia.ca"
      + id                          = (known after apply)
      + identity_type               = (known after apply)
      + tags_all                    = (known after apply)
      + verified_for_sending_status = (known after apply)

      + dkim_signing_attributes (known after apply)
    }

  # aws_sesv2_email_identity.notification-canada-ca will be created
  + resource "aws_sesv2_email_identity" "notification-canada-ca" {
      + arn                         = (known after apply)
      + email_identity              = "notification.canada.ca"
      + id                          = (known after apply)
      + identity_type               = (known after apply)
      + tags_all                    = (known after apply)
      + verified_for_sending_status = (known after apply)

      + dkim_signing_attributes (known after apply)
    }

  # aws_sesv2_email_identity.notification-canada-ca-receiving will be created
  + resource "aws_sesv2_email_identity" "notification-canada-ca-receiving" {
      + arn                         = (known after apply)
      + email_identity              = "notification.canada.ca"
      + id                          = (known after apply)
      + identity_type               = (known after apply)
      + tags_all                    = (known after apply)
      + verified_for_sending_status = (known after apply)

      + dkim_signing_attributes (known after apply)
    }

Plan: 5 to add, 0 to change, 5 to destroy.

Changes to Outputs:
  - ses_verification                      = "Ohfl/Syh3ZT5U/7IKELTCXIRaqI42ZJiw0HiUQoCHww=" -> null

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.internal_dns"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.internal_dns"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.notification-canada-ca[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.internal_dns_cert_base64"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.internal_dns_fqdn"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.internal_dns_key_base64"]
WARN - plan.json - main - Missing Common Tags: ["aws_sesv2_email_identity.cic-trvapply-vrtdemande[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_sesv2_email_identity.custom_sending_domains[\"notification.gov.bc.ca\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_sesv2_email_identity.custom_sending_domains[\"notify.novascotia.ca\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_sesv2_email_identity.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_sesv2_email_identity.notification-canada-ca-receiving"]

30 tests, 19 passed, 11 warnings, 0 failures, 0 exceptions

```

</details>
